In [1]:
!pip install pandas;

Requirement already satisfied: pandas in c:\users\student\anaconda3\envs\multi\lib\site-packages (0.25.0)
Requirement already satisfied: pytz>=2017.2 in c:\users\student\anaconda3\envs\multi\lib\site-packages (from pandas) (2019.2)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\student\anaconda3\envs\multi\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: numpy>=1.13.3 in c:\users\student\anaconda3\envs\multi\lib\site-packages (from pandas) (1.17.0)
Requirement already satisfied: six>=1.5 in c:\users\student\anaconda3\envs\multi\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)

In [1]:
import pandas as pd;

In [14]:
s1 = pd.Series([10,20,30,40,50])
s1.index
s1.index[0]
s1.values
s1.values[0]
s1.keys()
s1.keys()[0]
s1.name = 'Series1'
s1.name
s1.index.name = 'index1'
s1.index.name

'index1'

In [26]:
s1 = pd.Series([10,20,30,40], index = ['A','B','C','D'])
s1.index
s1.index[1]
s1.values
s1.values[0]
s1.keys()
s1.keys()[0]
s1.index.name = '점수'
s1.index.name
s1.name = '학생정보'
s1.name

점수
A    10
B    20
C    30
D    40
Name: 학생정보, dtype: int64

In [33]:
#벡터연산 가능
#인덱스는 계산되지 않는다.
s1/10
#본래값은 변화없다.
s1
#접근: 순서, index
s1[0]
s1['A']
#index존재여부
'A' in s1

True

In [104]:
s1[s1 > 20]
's1[True, False, True, True, False]]'

s2 = s1[(s1 > 20) & (s1 < 50)]
type(s1)
s2.size
#차원(1차원)
s2.shape
#개수
s1.count()

KeyError: {False, True}

In [58]:
#빈도수
s2 = pd.Series([10,10,10,20,20,30])
s2.value_counts()

10    3
20    2
30    1
dtype: int64

In [59]:
s2.dtype

dtype('int64')

In [70]:
s1 = pd.Series([15,3,20,11])
#값 sort
s1.sort_values()
#index sort
s1.sort_index()

#desc sort
s1.sort_values(ascending = False)

2    20
0    15
3    11
1     3
dtype: int64

In [94]:
s2 = pd.Series([10,10,10,20,20,30,None])
s2.unique()
s2.nunique() #unique 개수

3

In [87]:
s2.isin([10,1])

0     True
1     True
2     True
3    False
4    False
5    False
6    False
dtype: bool

In [97]:
s1.sum()
s1.describe()

count     4.000000
mean     12.250000
std       7.182154
min       3.000000
25%       9.000000
50%      13.000000
75%      16.250000
max      20.000000
dtype: float64

In [101]:
#dataframe - series별로 구성(2차원 형태)
df = pd.DataFrame({'score':[100,200,300,400,500],
                   'eng':['seoul','daegu','inchun','busan','kwangju'],
                   'kor':['서울','대구','인천','부산','광주']})
df
#type(df)

   score      eng kor
0    100    seoul  서울
1    200    daegu  대구
2    300   inchun  인천
3    400    busan  부산
4    500  kwangju  광주

In [103]:
s1 = pd.Series([200,10,100,500,30])
s2 = pd.Series(['seoul','daegu','inchun','busan','kwangju'])
s3 = pd.Series(['서울','대구','인천','부산','광주'])

df = pd.DataFrame(data=dict(score=s1, eng=s2, kor=s3))
df

   score      eng kor
0    200    seoul  서울
1     10    daegu  대구
2    100   inchun  인천
3    500    busan  부산
4     30  kwangju  광주

In [107]:
dataList = [{'score':'100','name':'홍길동'},
            {'score':'100','name':'홍길동'},
            {'score':'100','name':'홍길동'}]
df = pd.DataFrame(dataList);
df

  score name
0   100  홍길동
1   100  홍길동
2   100  홍길동

In [113]:
type(df['name']) #series
type(df[['score','name']]) #dataframe

pandas.core.frame.DataFrame

In [266]:
data_frame1 = pd.read_csv("data/friend_list.txt")
data_frame2 = pd.read_csv("data/friend_list_tab.txt", "\t")

#data_frame3 = pd.read_csv("data/friend_list_no_head.csv",  header=None)
#data_frame3.columns=["이름","나이","직업"]
data_frame3 = pd.read_csv("data/friend_list_no_head.csv",
                header=None, names =["이름","나이","직업"])

data_frame4 = pd.read_csv("data/friend_list.csv", index_col= "name")
data_frame4

       age        job
name
John    20    student
Jenny   30  developer
Nate    30    teacher
Julia   40    dentist
Brian   45    manager
Chris   25     intern

In [273]:
df = pd.read_csv('data/friend_list3.tsv','\t', header=None,
                    names=['이름','나이','직업'])
df

  이름  나이  직업
0  김  10  학생
1  양  15  학생

In [138]:
df['이름']

0    김
1    양
Name: 이름, dtype: object

In [270]:
df.to_csv('data/friend_list_backup1.csv', index=False)
pd.read_csv('data/friend_list_backup1.csv')

  이름  나이  직업
0  김  10  학생
1  양  15  학생

In [383]:
df = pd.read_csv("data/friend_list.csv")
print('type:',type(df))
print('shape:',df.shape)
print('size:',df.size)
print('dtype:',df.dtypes) #object -> string
print('columns:',df.columns)
df

type: <class 'pandas.core.frame.DataFrame'>
shape: (6, 3)
size: 18
dtype: name    object
age      int64
job     object
dtype: object
columns: Index(['name', 'age', 'job'], dtype='object')

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name    6 non-null object
age     6 non-null int64
job     6 non-null object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [199]:
#이름이용 
df.loc[0,'job']
#순서이용
df.iloc[0,2]

'student'

In [198]:
data_frame4.loc['John','job']
data_frame4.iloc[0, 1]

'student'

In [214]:
df[1:3]
#인덱스로 row 추출..Series
df.loc[1]
#row순서로 row 추출..Series
df.iloc[1]

#특정 index추출
df.loc[[0,2]]
df.loc[0:3,]
df.loc[0:3,['job', 'age']]

         job  age
0    student   20
1  developer   30
2    teacher   30
3    dentist   40

In [227]:
df[df.age >= 30]
df.query('age >= 30 & job == "manager"')
df[(df.age >= 30) & (df.job == 'manager')]

    name  age      job
4  Brian   45  manager

In [242]:
#행방향..index이용
df.filter(like='1', axis=0)
#열방향
df.filter(like='a', axis=1)
df.filter(regex='e$', axis=1) #$는 끝
df.filter(regex='^a', axis=1) #^는 시작

   age
0   20
1   30
2   30
3   40
4   45
5   25

In [244]:
#특정 컬럼들을 추출 --> dataframe
df[['name','age']]
df.filter(items=['name','age'])

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [261]:
df2 = df
df2.drop([1,3], inplace=True)

    name  age      job
2   Nate   30  teacher
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [289]:
#age가 30이상인 사람 지우기
df2 = df
df2.drop(df2[df.age>=30].index, inplace=True)
df2

    name  age      job
0   John   20  student
5  Chris   25   intern

In [384]:
df =pd.DataFrame({'name':['min','you','jin'],
                  'midterm':[80,90,98],
                  'final':[10,88,95]})

In [385]:
df['total'] = df['midterm'] + df['final']
df['average'] = df['total']/2


grades = []
for row in df["average"]:
    if row >= 90:
        grades.append("A")
    elif row>=80:
        grades.append("B")
    else:
        grades.append("F")
df["grade"] = grades

df

  name  midterm  final  total  average grade
0  min       80     10     90     45.0     F
1  you       90     88    178     89.0     B
2  jin       98     95    193     96.5     A

In [398]:
def getGrade(average):
    if average >= 90:
        return 'A'
    elif average>=80:
        return 'B'
    else:
        return 'F'

df['grade'] = df.average.apply(getGrade)
df

    name  midterm  final  total  average grade  pnp
0      민       80     10   90.0     45.0     F  불합격
1    you       90     88  178.0     89.0     B   합격
2    jin       98     95  193.0     96.5     A   합격
99  kang       76     20   96.0     48.0     F   합격

In [412]:
def PNP(grade):
    if grade != 'F':
        return '합격'
    else:
        return '불합격'
df['pnp'] = df.grade.apply(PNP)
df['pnp'] = df.grade.apply(lambda g:'합격' if g!='F' else '불합격')
df

    name  midterm  final  total  average grade  pnp
0    min       80     10   90.0     45.0     F  불합격
1    you       90     88  178.0     89.0     B   합격
2    jin       98     95  193.0     96.5     A   합격
99  kang       76     20   96.0     48.0     F  불합격

In [388]:
#name의 첫 글자만 잘라 따로 저장
'min'[0]
name2 = []
# for i in df['name']:
#     name2.append(i[0])
# df['name2'] = name2
# df

df['name2'] = df.name.apply(lambda x:x[0])
df

  name  midterm  final  total  average grade  pnp name2
0  min       80     10     90     45.0     F  불합격     m
1  you       90     88    178     89.0     B   합격     y
2  jin       98     95    193     96.5     A   합격     j

In [389]:
#df칼럼지우기...default->행기준
df.drop('name2', axis=1, inplace=True)
df

  name  midterm  final  total  average grade  pnp
0  min       80     10     90     45.0     F  불합격
1  you       90     88    178     89.0     B   합격
2  jin       98     95    193     96.5     A   합격

In [409]:
#주소복사 df2수정시 df도 변경.
df2 = df
df2.loc[0,'name'] = '민'
df2
df

    name  midterm  final  total  average grade  pnp
0    min       80     10   90.0     45.0     F  불합격
1    you       90     88  178.0     89.0     B   합격
2    jin       98     95  193.0     96.5     A   합격
99  kang       76     20   96.0     48.0     F   합격

In [410]:
#값의 복사
df2 = df.copy()
df2.loc[0,'name'] = '민'
df2
df

    name  midterm  final  total  average grade  pnp
0    min       80     10   90.0     45.0     F  불합격
1    you       90     88  178.0     89.0     B   합격
2    jin       98     95  193.0     96.5     A   합격
99  kang       76     20   96.0     48.0     F   합격

In [413]:
#인덱스 이름을 다르게 해서 마지막에 데이터 추가
df.loc[99,'name'] = 'kang'
df

    name  midterm  final  total  average grade  pnp
0    min       80     10   90.0     45.0     F  불합격
1    you       90     88  178.0     89.0     B   합격
2    jin       98     95  193.0     96.5     A   합격
99  kang       76     20   96.0     48.0     F  불합격

In [415]:
df['birth'] = ['1999-01-05','2001-03-04','2002-12-17','2000-04-05']
df['year'] = df.birth.apply(lambda x:x[0:4])
df

    name  midterm  final  total  average grade  pnp       birth  year
0    min       80     10   90.0     45.0     F  불합격  1999-01-05  1999
1    you       90     88  178.0     89.0     B   합격  2001-03-04  2001
2    jin       98     95  193.0     96.5     A   합격  2002-12-17  2002
99  kang       76     20   96.0     48.0     F  불합격  2000-04-05  2000

In [419]:
df.drop(['year'], axis = 1, inplace = True)

KeyError: "['year'] not found in axis"

In [425]:
df2 = df.copy()
df2['name'] = ['도형','승희','가영','완수']
df2

   name  midterm  final  total  average grade  pnp       birth
0    도형       80     10   90.0     45.0     F  불합격  1999-01-05
1    승희       90     88  178.0     89.0     B   합격  2001-03-04
2    가영       98     95  193.0     96.5     A   합격  2002-12-17
99   완수       76     20   96.0     48.0     F  불합격  2000-04-05

In [468]:
df3 = pd.concat([df,df2], ignore_index = True)
df3.loc[3,'name'] = '완수'
df3

  name  midterm  final  total  average grade  pnp       birth
0  min       80     10   90.0     45.0     F  불합격  1999-01-05
1  you       90     88  178.0     89.0     B   합격  2001-03-04
2  jin       98     95  193.0     96.5     A   합격  2002-12-17
3   완수       76     20   96.0     48.0     F  불합격  2000-04-05
4   도형       80     10   90.0     45.0     F  불합격  1999-01-05
5   승희       90     88  178.0     89.0     B   합격  2001-03-04
6   가영       98     95  193.0     96.5     A   합격  2002-12-17
7   완수       76     20   96.0     48.0     F  불합격  2000-04-05

In [473]:
#원본에는 영향을 미치지 않는다.
df3.drop_duplicates(["name"], keep="last")
df3

  name  midterm  final  total  average grade  pnp       birth
0  min       80     10   90.0     45.0     F  불합격  1999-01-05
1  you       90     88  178.0     89.0     B   합격  2001-03-04
2  jin       98     95  193.0     96.5     A   합격  2002-12-17
3   완수       76     20   96.0     48.0     F  불합격  2000-04-05
4   도형       80     10   90.0     45.0     F  불합격  1999-01-05
5   승희       90     88  178.0     89.0     B   합격  2001-03-04
6   가영       98     95  193.0     96.5     A   합격  2002-12-17
7   완수       76     20   96.0     48.0     F  불합격  2000-04-05